#include <pl2d.hpp>

namespace pl2d {

//* ----------------------------------------------------------------------------------------------------
//; 渐进高清晰度 progressive high definition
//* ----------------------------------------------------------------------------------------------------
// 在图像压缩算法中，渐进高清是一种渐进式加载图像的方式。
// 这种加载方式允许图像在传输过程中逐步显示，而不是一次性加载完整的图像。
// 渐进高清图像从模糊到清晰逐渐过渡，用户可以在图像加载的早期阶段获得基本的视觉信息，
// 并且随着加载的进行越来越清晰，这种方法对于网络环境不稳定或带宽有限的情况下尤为有用。

void progressive_HD(u32 *obuf, const u32 *ibuf, size_t width, size_t height) {}

void inv_progressive_HD(u32 *obuf, const u32 *ibuf, size_t width, size_t height) {}

} // namespace pl2d
